{
  "models": {
    "brt": ["Boosted Regression Trees (BRT) combine regression trees with boosting to create powerful predictive models. In BRT, decision trees are sequentially grown, focusing on minimizing residuals from previous trees. The algorithm iteratively adds weak learners, weighted by their performance, to minimize a loss function. BRT excels in capturing complex relationships and is used in regression and classification tasks across various domains. Its sequential nature and ensemble approach make it highly accurate and interpretable, making BRT a popular choice in fields like ecology, finance, and healthcare. BRT are implemented here trhough the package `gbm`"],
    "rf": ["Random Forest (RF) is a versatile ensemble learning method that constructs multiple decision trees during training and aggregates their predictions for robust classification or regression. It mitigates overfitting and captures complex relationships in data by averaging predictions across trees, making it resilient to noise and outliers."],
    "maxent": ["Maxent, or Maximum Entropy Modeling, is a probabilistic machine learning algorithm used primarily for species distribution modeling. It estimates the distribution of a species by maximizing entropy subject to environmental constraints, making it suitable for ecological niche modeling and predicting species distributions based on environmental variables."],
    "xgboost": ["XGBoost, short for Extreme Gradient Boosting, is a scalable and efficient implementation of gradient boosting machines. It builds an ensemble of weak learners in a sequential manner, focusing on minimizing a differentiable loss function. XGBoost excels in both speed and performance, handling large datasets and complex relationships in data, and is widely used in various domains for classification and regression tasks."],
    "elasticnet": ["Elastic Net is a regularization technique that combines the penalties of L1 (Lasso) and L2 (Ridge) regularization methods. It strikes a balance between variable selection and model interpretability by simultaneously penalizing large coefficients (L1) and the square of coefficients (L2), making it effective for feature selection and handling multicollinearity in regression tasks."],
    "glm": ["GLM, or Generalized Linear Models, is a flexible framework for modeling relationships between a dependent variable and one or more independent variables. It encompasses various regression models, including linear regression, logistic regression, and Poisson regression, and allows for different types of response distributions. GLM provides interpretable parameter estimates and inference, making it widely used in statistical modeling for understanding relationships between variables."],
    "gam": ["GAM, or Generalized Additive Models, extend GLMs by allowing for nonlinear relationships between predictors and the response variable. GAMs use smoothing functions to model complex nonlinear relationships, offering flexibility in capturing intricate patterns in the data while maintaining interpretability. They are particularly useful for modeling complex relationships in environmental and ecological data, where traditional linear models may be inadequate."],
    "lasso": ["LASSO, or Least Absolute Shrinkage and Selection Operator, is a regularization technique that penalizes the absolute size of the coefficients, forcing some of them to be exactly zero. This encourages sparsity in the model, making it useful for feature selection and reducing model complexity. LASSO performs variable selection by shrinking coefficients towards zero, making it interpretable and effective in high-dimensional datasets with many predictors."],
    "lightgbm": ["LightGBM is a gradient boosting framework that optimizes training efficiency and model performance through histogram-based algorithms. It partitions the data in a leaf-wise manner, minimizing the loss function more effectively and reducing computational resources compared to traditional depth-wise methods. LightGBM excels in handling large datasets and complex relationships, making it suitable for a wide range of tasks such as classification, regression, and ranking."],
    "ensemble": ["Ensemble methods play a crucial role in species distribution modeling (SDM), where multiple models are combined to improve predictive performance and robustness. By aggregating predictions from diverse models, ensembles can capture a broader range of environmental relationships and account for uncertainties inherent in SDM. Ensemble techniques, such as stacking, bagging, and boosting, leverage the strengths of individual models while mitigating their weaknesses, leading to more accurate and reliable predictions of species distributions. These ensemble approaches are widely adopted in SDM to enhance model generalization, increase prediction accuracy, and provide valuable insights for biodiversity conservation and management."]
  },
  "habitats": {
    "seagrass": ["Definition: long-lived | Species: <i>Posidonia oceanica</i>, <i>Cymodocea nodosa</i>, <i>Zostera marina</i>"],
    "kelp": ["Definition: three-dimensional | Species: <i>Laminaria hyperborea</i>, <i>Laminaria ochroleuca</i>, <i>Laminaira saccharina</i>, <i>Saccorhiza polyschides</i>"],
    "polychaete_reefs": ["Definition: large enough to provide habitat for other groups | Species: <i>Sabellaria alveolata</i>, <i>Sabellaria spinulosa</i>"],
    "maerl": ["Definition: three-dimensional | Species: <i>Lithothamnion corallioides</i>, <i>Lithothamnion glaciale</i>, <i>Phymatolithon calcareum</i>" ],
    "bivalves_beds": ["Definition: three-dimensional | Species: <i>Mytilus edulis</i>, <i>Mytilus galloprovincialis</i>, <i>Modiolus modiolus</i>, <i>Ostrea edulis</i>"],
    "corals": ["Definition: large enough to provide habitat for fish | Species: <i>Desmophyllum pertusum</i>, <i>Madreporia oculata</i>, <i>Solenosmilia variabilis</i>"]
  }
}
